kAMDSuccess = "لم يكن هنالك خطأ.";
kAMDUndefinedError = "حدث خطأ غير معروف.";
kAMDBadHeaderError = "تعذر تحويل الملف.";
kAMDNoResourcesError = "تعذر تخصيص المصدر.";
kAMDReadError = "لا يمكن القراءة من الجهاز.";
kAMDWriteError = "لا يمكن الكتابة للجهاز.";
kAMDUnknownPacketError = "الحزمة غير معروفة.";
kAMDInvalidArgumentError = "المُعطى غير صالح.";
kAMDNotFoundError = "لا يمكن العثور على الملف .";
kAMDIsDirectoryError = "المسار عبارة عن دليل.";
kAMDPermissionError = "لا يتوفر لديك الإذن.";
kAMDNotConnectedError = "غير متصل بالجهاز.";
kAMDTimeOutError = "انتهت مهلة العملية.";
kAMDOverrunError = "كان هنالك مخترق الدارئ.";
kAMDEOFError = "نهاية الملف.";
kAMDUnsupportedError = "هذه العملية غير مدعومة.";
kAMDFileExistsError = "الملف موجود مسبقًا.";
kAMDBusyError = "الجهاز مشغول.";
kAMDCryptoError = "تعذر إجراء اتصال آمن للجهاز.";
kAMDTooBigError = "الرسالة كبيرة جدًا.";
kAMDInvalidResponseError = "تم تلقي استجابة غير متوقعة من الجهاز.";
kAMDMissingKeyError = "المفتاح مفقود.";
kAMDMissingValueError = "القيمة مفقودة.";
kAMDGetProhibitedError = "لا يمكن استرداد القيمة من الجهاز المقفل برمز الدخول.";
kAMDSetProhibitedError = "لا يمكن تعيين القيمة على الجهاز.";
kAMDRemoveProhibitedError = "لا يمكن إزالة القيمة من الجهاز.";
kAMDImmutableValueError = "لا يمكن تغير هذه القيمة.";
kAMDPasswordProtectedError = "الجهاز محمي برمز الدخول.";
kAMDMissingHostIDError = "لم يتعرف الجهاز على هذا المضيف.";
kAMDInvalidHostIDError = "لم يتعرف الجهاز على هذا المضيف.";
kAMDSessionActiveError = "الدورة فعالة.";
kAMDSessionInactiveError = "الدورة غير فعالة.";
kAMDMissingSessionIDError = "هوية الدورة مفقودة.";
kAMDInvalidSessionIDError = "هوية الدورة غير صالحة.";
kAMDMissingServiceError = "الخدمة مفقودة.";
kAMDInvalidServiceError = "الخدمة غير صالحة.";
kAMDServiceLimitError = "كثير من الحالات على هذه الخدمة جارية التشغيل.";
kAMDCheckinSetupFailedError = "تعذر بدء الخدمة على الجهاز";
kAMDInvalidCheckinError = "تعذر بدء الخدمة على الجهاز";
kAMDCheckinTimeoutError = "لم تبدأ الخدمة بشكل صحيح على الجهاز.";
kAMDCheckinConnectionFailedError = "لم تبدأ الخدمة بشكل صحيح على الجهاز.";
kAMDCheckinReceiveFailedError = "لم تبدأ الخدمة بشكل صحيح على الجهاز.";
kAMDCheckinResponseFailedError = "لم تبدأ الخدمة بشكل صحيح على الجهاز.";
kAMDCheckinOutOfMemoryError = "لم تبدأ الخدمة بشكل صحيح على الجهاز.";
kAMDCheckinSendFailedError = "لم تبدأ الخدمة بشكل صحيح على الجهاز.";
kAMDMissingPairRecordError = "المضيف غير مقترن بالجهاز.";
kAMDInvalidPairRecordError = "لم يعد المضيف مقترن بالجهاز.";
kAMDSavePairRecordFailedError = "تعذر حفظ التسجيل المقترن.";
kAMDInvalidActivationRecordError = "سجل التنشيط غير صالح.";
kAMDMissingActivationRecordError = "تعذر العثور على سجل التنشيط.";
kAMDServiceProhibitedError = "لا يمكن بدء الخدمة على الجهاز.";
kAMDEscrowLockedError = "الجهاز غير متوفر حتى يتم فك قفله أولًا بعد إعادة التشغيل.";
kAMDProhibitedBySupervision = "عملية محظورة على الأجهزة الخاضعة للإشراف.";
kAMDPairingProhibitedError = "يسمح الاقتران عبرالـ USB فقط.";
kAMDWrongDroidError = "الجهاز في نمط الاستعادة.";
kAMDSUVerificationError = "لا يمكن التحقق من حزمة محدّث البرنامج.";
kAMDSUPatchError = "تعذر تصحيح الملف.";
kAMDSUFirmwareError = "تعذر تحديث البرنامج الثابت.";
kAMDProvisioningProfileNotValid = "ملف تعريف التموين غير صالح.";
kAMDSendMessageError = "تعذر إرسال الرسالة للجهاز.";
kAMDReceiveMessageError = "لا يمكن استلام رسالة من الجهاز.";
kAMDMissingOptionsError = "الخيارات مفقودة.";
kAMDMissingImageTypeError = "الصورة مفقودة.";
kAMDDigestFailedError = "تعذر قراءة صورة القرص.";
kAMDStartServiceError = "لا يمكن بدء الخدمة.";
kAMDInvalidDiskImageError = "صورة القرص غير صالحة.";
kAMDMissingDigestError = "الخلاصة مفقودة.";
kAMDMuxError = "كان هنالك خطأ مع ناخب جهاز USB.";
kAMDApplicationAlreadyInstalledError = "تم تثبيت تطبيق النظام مع معرّف الحزمة مسبقًا على الجهاز ولا يمكن استبداله.";
kAMDApplicationMoveFailedError = "تعذر نقل التطبيق إلى مكان على الجهاز.";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "لا يمكن تحديد الوصول للتطبيق.";
kAMDApplicationVerificationFailedError = "تعذر التحقق من التطبيق.";
kAMDArchiveDestructionFailedError = "تعذر إزالة أرشيف التطبيق.";
kAMDBundleVerificationFailedError = "تعذر التحقق من حزمة شركة الاتصالات.";
kAMDCarrierBundleCopyFailedError = "تعذر تثبيت حزمة شركة الاتصالات.";
kAMDCarrierBundleDirectoryCreationFailedError = "تعذر إنشاء دليل حزمة شركة الاتصالات.";
kAMDCarrierBundleMissingSupportedSIMsError = "لا يوجد أي SIM مدعوم لشركة الاتصالات هذه.";
kAMDCommCenterNotificationFailedError = "تعذر الاستماع للإشعار من النطاق الأساسي.";
kAMDContainerCreationFailedError = "تعذر إنشاء صندوق التطبيق.";
kAMDContainerP0wnFailedError = "تعذر إصلاح الأذون لصندوق التطبيق.";
kAMDContainerRemovalFailedError = "تعذر إزالة صندوق التطبيق.";
kAMDEmbeddedProfileInstallFailedError = "تعذر تثبيت ملف تعريف التموين المُضمن.";
kAMDErrorError = "حدث خطأ.";
kAMDExecutableTwiddleFailedError = "تعذر تغيير الأذون التنفيذية على التطبيق.";
kAMDExistenceCheckFailedError = "تعذر التحقق لرؤية إذا كان التطبيق موجود مسبقًا.";
kAMDInstallMapUpdateFailedError = "تعذر تحديث قائمة التطبيقات المثبتة.";
kAMDManifestCaptureFailedError = "تعذر حفظ وثيقة التطبيق.";
kAMDMapGenerationFailedError = "تعذر توليد الخريطة.";
kAMDMissingBundleExecutableError = "لا تحتوي حزمة التطبيق على منفذ.";
kAMDMissingBundleIdentifierError = "لا تحتوي حزمة التطبيق على معرف صالح.";
kAMDMissingBundlePathError = "تعذر تحديد مسار حزمة التطبيق.";
kAMDMissingContainerError = "تعذر العثور على الصندوق للتطبيق الذي تم تثبيته.";
kAMDNotificationFailedError = "تعذر إرسال الإشعار.";
kAMDPackageExtractionFailedError = "تعذر فتح حزمة التطبيق.";
kAMDPackageInspectionFailedError = "تعذر فحص حزمة التطبيق.";
kAMDPackageMoveFailedError = "تعذر نقل حزمة التطبيق إلى الموقع المؤقت.";
kAMDPathConversionFailedError = "تعذر تحويل المسار.";
kAMDRestoreContainerFailedError = "تعذر استعادة معلومات صندوق التطبيق.";
kAMDSeatbeltProfileRemovalFailedError = "تعذر إزالة تطبيق ملف التعريف الآمن.";
kAMDStageCreationFailedError = "تعذر إنشاء الدليل المؤقت.";
kAMDSymlinkFailedError = "تعذر إنشاء رابط رمزي.";
kAMDiTunesArtworkCaptureFailedError = "تعذر حفظ الأعمال الفنية لـ iTunes.";
kAMDiTunesMetadataCaptureFailedError = "تعذر حفظ بيانات iTunes.";
kAMDAlreadyArchivedError = "تمت أرشفة التطبيق مسبقًا.";
kAMDUnknownCommandError = "لم يتعرف الجهاز على هذا الأمر.";
kAMDAPIInternalError = "كان هنالك خطأ API داخلي.";
kAMDMuxCreateListenerError = "لا يمكن الاستماع لأجهزة USB.";
kAMDMuxGetListenerError = "تعذر إحضار مستمع USB.";
kAMDMuxConnectError = "تعذر الاتصال بالجهاز.";
kAMDDeviceTooNewError = "هذا التطبيق يحتاج إلى تحديث.";
kAMDDeviceRefNoGood = "لم يعد هذا الجهاز متصل.";
kAMDDeviceDisconnectedError = "لم يعد هذا الجهاز متصل.";
kAMDCannotTranslateError = "لا يمكن ترجمة الرسائل من الجهاز";
kAMDMobileImageMounterMissingImageSignature = "تعذر دعم التطوير.";
kAMDMobileImageMounterResponseCreationFailed = "تعذر دعم التطوير.";
kAMDMobileImageMounterMissingImageType = "تعذر دعم التطوير.";
kAMDMobileImageMounterMissingImagePath = "تعذر دعم التطوير.";
kAMDMobileImageMounterImageMapLoadFailed = "تعذر دعم التطوير.";
kAMDMobileImageMounterAlreadyMounted = "تعذر دعم التطوير.";
kAMDMobileImageMounterImageMoveFailed = "تعذر دعم التطوير.";
kAMDMobileImageMounterMountPathMissing = "تعذر دعم التطوير.";
kAMDMobileImageMounterMountPathNotEmpty = "تعذر دعم التطوير.";
kAMDMobileImageMounterImageMountFailed = "تعذر دعم التطوير.";
kAMDMobileImageMounterTrustCacheLoadFailed = "تعذر دعم التطوير.";
kAMDMobileImageMounterDigestFailed = "تعذر دعم التطوير.";
kAMDMobileImageMounterDigestCreationFailed = "تعذر دعم التطوير.";
kAMDMobileImageMounterImageVerificationFailed = "تعذر دعم التطوير.";
kAMDMobileImageMounterImageInfoCreationFailed = "تعذر دعم التطوير.";
kAMDMobileImageMounterImageMapStoreFailed = "تعذر دعم التطوير.";
kAMDDeviceOSVersionTooLow = "جهاز إصدار OS قديم جدًا.";
kAMDNoWifiSyncSupportError = "الجهاز لا يدعم المزامنة اللاسلكية.";
kAMDDeviceFamilyNotSupported = "هذا التطبيق لا يدعم مثل هذا الجهاز.";
kAMDPackagePatchFailedError = "تعذر تطبيق تحديث التصحيح إلى التطبيق.";
kAMDIncorrectArchitectureError = "هذا التطبيق يدعم نوع الـ CPU لهذا الجهاز.";
kAMDPluginCopyFailedError = "تعذر نسخ VPN البرنامج المساعد في صندوق التطبيق.";
kAMDBreadcrumbFailedError = "تعذر كتابة التثبيت التفصيلي.";
kAMDBreadcrumbUnlockError = "تعذر تحديث التثبيت التفصيلي.";
kAMDGeoJSONCaptureFailedError = "تعذر حفظ بيانات GeoJSON.";
kAMDNewsstandArtworkCaptureFailedError = "تعذر حفظ الأعمال الفنية لزاوية الأخبار.";
kAMDMissingCommandError = "إن الطلب لا يحتوي على الأمر.";
kAMDNotEntitledError = "التطبيق المطلوب غير مسموح لعمل هذا الطلب.";
kAMDMissingPackagePathError = "يفتقد الطلب مسار الحزمة.";
kAMDMissingContainerPathError = "يفتقد الطلب مسار الصندوق.";
kAMDMissingApplicationIdentifierError = "يفتقد الطلب معرّف التطبيق.";
kAMDMissingAttributeValueError = "يفتقد الطلب القيمة المطلوبة.";
kAMDLookupFailedError = "تعذر عرض التطبيقات المثبتة.";
kAMDDictCreationFailedError = "تعذر استخراج الإمكانيات من الطلب.";

/* kMISFileError */
"A file operation failed." = "فشلت عملية الملف.";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "تم إضافة، تعديل، أو حذف المصدر الموّقع.";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "تعذر العثور على ملف تموين صالح لهذا المنفذ.";

/* kMISUnknownError */
"An unknown error has occurred." = "حدث خطأ غير معروف.";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "محاولة لتعديل ملف التموين الثابت.";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "لا يحتوي التطبيق على توقيع صحيح.";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "توقيع التطبيق صحيح ولكن لا يتطابق مع التجزئة المتوقعة.";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "يحتوي المنفذ على توقيع غير صالح.";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "تم توقيع المنفذ بتفويض غير صحيح.";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "الهوية المستخدمة لتوقيع المنفذ لم تعُد صحيحة.";

/* kMISSignatureNotValidError */
"The signature was not valid." = "التوقيع غير صالح.";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "حدث خطأ أثناء الاتصال مع الجهاز الخاص بك.";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "لا يمكن تثبيت ملف التموين هذا على هذا الجهاز.";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "لا يحتوي ملف التموين هذا على توقيع صحيح (أو يحتوي على توقيع صحيح، ولكن غير موثوق).";

/* kMISExpiredError */
"This provisioning profile has expired." = "انتهت صلاحية ملف تعريف التموين هذا.";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "ملف تعريف التموين هذا غير صحيح.";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "ملف تعريف التموين هذا غير مدعوم.";

/* kMISAllocationError */
"Unable to allocate memory." = "تعذر تخصيص الذاكرة.";

